In [ ]:
import pandas as pd


melb_data = pd.read_csv('data/melb_data.csv', sep=',')

In [ ]:
melb_data.describe()

              index         Rooms  ...    Longtitude  Propertycount
count  13580.000000  13580.000000  ...  13580.000000   13580.000000
mean    6789.500000      2.937997  ...    144.995216    7454.417378
std     3920.352663      0.955748  ...      0.103916    4378.581772
min        0.000000      1.000000  ...    144.431810     249.000000
25%     3394.750000      2.000000  ...    144.929600    4380.000000
50%     6789.500000      3.000000  ...    145.000100    6555.000000
75%    10184.250000      3.000000  ...    145.058305   10331.000000
max    13579.000000     10.000000  ...    145.526350   21650.000000

[8 rows x 14 columns]

In [ ]:
melb_data.head(5)

   index      Suburb  ... Propertycount         Сoordinates
0      0  Abbotsford  ...        4019.0  -37.7996, 144.9984
1      1  Abbotsford  ...        4019.0  -37.8079, 144.9934
2      2  Abbotsford  ...        4019.0  -37.8093, 144.9944
3      3  Abbotsford  ...        4019.0  -37.7969, 144.9969
4      4  Abbotsford  ...        4019.0  -37.8072, 144.9941

[5 rows x 23 columns]

In [ ]:
print(melb_data.loc[15]['Price'])
print(melb_data.loc[90]['Date'])

print(melb_data.loc[3521]['Landsize']/melb_data.loc[1690]['Landsize'])

1310000.0
10/09/2016
2.7857142857142856

In [ ]:
melb_data.describe().loc[:, ['Distance', 'BuildingArea' , 'Price']]

           Distance  BuildingArea         Price
count  13580.000000  13580.000000  1.358000e+04
mean      10.137776    139.633972  1.075684e+06
std        5.868725    392.217403  6.393107e+05
min        0.000000      0.000000  8.500000e+04
25%        6.100000    122.000000  6.500000e+05
50%        9.200000    126.000000  9.030000e+05
75%       13.000000    129.940000  1.330000e+06
max       48.100000  44515.000000  9.000000e+06

In [ ]:
data = pd.DataFrame([[0,1], [1, 0], [1, 1]], columns=['А', 'B'])
print(data.shape)

(3, 2)

In [ ]:
type(melb_data['Сoordinates'])

pandas.core.series.Series

In [ ]:
melb_data['Сoordinates'].dtypes

dtype('O')

In [ ]:
sum(melb_data['CouncilArea'].isnull())

1369

In [ ]:
melb_data['Postcode'] = melb_data['Postcode'].astype('int64')
melb_data['Car'] = melb_data['Car'].astype('int64')
melb_data['Bedroom'] = melb_data['Bedroom'].astype('int64')
melb_data['Bathroom'] = melb_data['Bathroom'].astype('int64')
melb_data['Propertycount'] = melb_data['Propertycount'].astype('int64')
melb_data['YearBuilt'] = melb_data['YearBuilt'].astype('int64')
melb_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 23 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   index          13580 non-null  int64
 1   Suburb         13580 non-null  object
 2   Address        13580 non-null  object
 3   Rooms          13580 non-null  int64
 4   Type           13580 non-null  object
 5   Price          13580 non-null  float64
 6   Method         13580 non-null  object
 7   SellerG        13580 non-null  object
 8   Date           13580 non-null  object
 9   Distance       13580 non-null  float64
 10  Postcode       13580 non-null  int64
 11  Bedroom        13580 non-null  int64
 12  Bathroom       13580 non-null  int64
 13  Car            13580 non-null  int64
 14  Landsize       13580 non-null  float64
 15  BuildingArea   13580 non-null  float64
 16  YearBuilt      13580 non-null  int64
 17  CouncilArea    12211 non-null  object
 18  Lattitude      13580 non-null  float64
 19  Longtitude     13580 non-null  float64
 20  Regionname     13580 non-null  object
 21  Propertycount  13580 non-null  int64
 22  Сoordinates    13580 non-null  object
dtypes: float64(6), int64(8), object(9)
memory usage: 2.4+ MB

In [ ]:
sum(melb_data.dtypes == 'int64')

8

In [ ]:
mu = melb_data['Price'].mean()
medi = melb_data['Price'].median()

print(mu, medi)
medi/mu > 10

1075684.079455081 903000.0

False

In [ ]:
melb_data['BuildingArea'].mean() > 180

False

In [ ]:
sum(melb_data['Distance'] == 0)

6

In [ ]:
melb_data.shape

(13580, 23)

In [ ]:
melb_data.loc[(melb_data['Distance'] > 6.1) & (melb_data['Distance'] < 13)].shape

(6679, 23)

In [ ]:
13580/6679 > 0.5

True

In [ ]:
melb_data[['Propertycount', 'Regionname']].min()

Propertycount                     249
Regionname       Eastern Metropolitan
dtype: object

In [ ]:
# 12.2
melb_data[['Propertycount', 'Regionname']].max()

Propertycount               21650
Regionname       Western Victoria
dtype: object

In [ ]:
len(melb_data[['CouncilArea', 'Regionname']]['Regionname'].unique())

8

In [ ]:
melb_data.loc[melb_data['Сoordinates'].duplicated()]

       index           Suburb  ... Propertycount           Сoordinates
22        22       Abbotsford  ...          4019    -37.8078, 144.9965
26        26       Abbotsford  ...          4019    -37.8016, 144.9988
28        28       Abbotsford  ...          4019    -37.8078, 144.9965
40        40     Airport West  ...          3464    -37.7203, 144.8755
111      111      Albert Park  ...          3280    -37.8415, 144.9585
...      ...              ...  ...           ...                   ...
13140  13140         Carnegie  ...          7822  -37.88642, 145.05979
13217  13217              Kew  ...         10331  -37.81439, 145.04237
13250  13250        Northcote  ...         11364  -37.77651, 144.99074
13280  13280         Richmond  ...         14949   -37.82009, 145.0038
13429  13429  Frankston South  ...          7566  -38.16457, 145.12421

[483 rows x 23 columns]

In [ ]:
sum(melb_data['Postcode'] == 3073)

359

In [ ]:
melb_data.describe(include=['object'])

           Suburb           Address  ...             Regionname         Сoordinates
count       13580             13580  ...                  13580               13580
unique        314             13378  ...                      8               13097
top     Reservoir  36 Aberfeldie St  ...  Southern Metropolitan  -37.8361, 144.9966
freq          359                 3  ...                   4695                  12

[4 rows x 9 columns]

In [ ]:
sum(melb_data['Type'] == 't')/melb_data.shape[0]

0.08203240058910162

In [ ]:
melb_data['Distance'].std()

5.868724943071692

In [ ]:
# Чему равно отклонение (в процентах) медианного значения площади здания от его среднего значения?
mu = melb_data['BuildingArea'].mean()
medi = melb_data['BuildingArea'].median()
abs((medi - mu)/mu) * 100

9.764079662364534

In [ ]:
pd.Series([1, 2, 4, 2, 3, 2, 1, 5, 6]).mode()

0    2
dtype: int64

In [ ]:
melb_data[['CouncilArea', 'Bedroom']].mode()

  CouncilArea  Bedroom
0    Moreland        3

In [ ]:
melb_data.columns

Index(['index', 'Suburb', 'Address', 'Rooms', 'Type', 'Price', 'Method',
       'SellerG', 'Date', 'Distance', 'Postcode', 'Bedroom', 'Bathroom', 'Car',
       'Landsize', 'BuildingArea', 'YearBuilt', 'CouncilArea', 'Lattitude',
       'Longtitude', 'Regionname', 'Propertycount', 'Сoordinates'],
      dtype='object')

In [ ]:
melb_data[melb_data['Bathroom'] == 0].shape[0]

34

In [ ]:
melb_data[(melb_data['SellerG'] == 'Nelson') & (melb_data['Price'] > 3000000)].shape[0]

5

In [ ]:
melb_data[melb_data['BuildingArea'] == 0]['Price'].min()

412500.0

In [ ]:
melb_data['Bedroom'].unique()

array([ 2,  3,  4,  1,  6,  5,  0,  8,  9,  7, 20, 10])

In [ ]:
# Задание 13.4

# Какова средняя цена объектов недвижимости в таблице melb_data с ценой менее одного миллиона, 
# в которых либо количество комнат больше пяти, либо здание моложе 2015 года?
# Округлите ответ до целого числа.

mask = ((melb_data['Price'] < 1000000) & ((melb_data['Rooms'] > 5 ) | (melb_data['YearBuilt'] > 2015)))

print(round(melb_data[mask]['Price'].mean()))

769239

In [ ]:
melb_data[((melb_data['Rooms'] == 3) | (melb_data['BuildingArea'] > 100)) & (melb_data['Price'] < 300000)].shape[0]
# 68

68

In [ ]:
# Задание 13.5

# В каком районе Мельбурна чаще всего продаются виллы и коттеджи (тип здания — h) 
# с ценой меньше трёх миллионов?

mask = (melb_data['Type'] == 'h') & (melb_data['Price'] < 3000000) 

melb_data[mask]['Regionname'].mode()

0    Northern Metropolitan
dtype: object

In [ ]:
melb_df = melb_data
melb_df = melb_df.drop(['index', 'Сoordinates'], axis=1)
melb_df.head()

       Suburb           Address  ...             Regionname Propertycount
0  Abbotsford      85 Turner St  ...  Northern Metropolitan          4019
1  Abbotsford   25 Bloomburg St  ...  Northern Metropolitan          4019
2  Abbotsford      5 Charles St  ...  Northern Metropolitan          4019
3  Abbotsford  40 Federation La  ...  Northern Metropolitan          4019
4  Abbotsford       55a Park St  ...  Northern Metropolitan          4019

[5 rows x 21 columns]

In [ ]:
total_rooms = melb_df['Rooms'] + melb_df['Bedroom'] + melb_df['Bathroom']
display(total_rooms)

0         5
1         5
2         8
3         8
4         8
         ..
13575    10
13576     8
13577     8
13578     9
13579     9
Length: 13580, dtype: int64

In [ ]:
melb_df['MeanRoomsSquare'] = melb_df['BuildingArea'] / total_rooms
display(melb_df['MeanRoomsSquare'])

0        25.200000
1        15.800000
2        18.750000
3        15.750000
4        17.750000
           ...
13575    12.600000
13576    16.625000
13577    15.750000
13578    17.444444
13579    12.444444
Name: MeanRoomsSquare, Length: 13580, dtype: float64

In [ ]:
diff_area = melb_df['BuildingArea'] - melb_df['Landsize']
sum_area = melb_df['BuildingArea'] + melb_df['Landsize']
melb_df['AreaRatio'] = diff_area/sum_area
display(melb_df['AreaRatio'])

0       -0.231707
1       -0.327660
2        0.056338
3        0.145455
4        0.083969
           ...
13575   -0.676093
13576   -0.429185
13577   -0.551601
13578   -0.693060
13579   -0.527426
Name: AreaRatio, Length: 13580, dtype: float64

In [ ]:
customer_df = pd.DataFrame({
        'number': [0, 1, 2, 3, 4],
        'cust_id': [128, 1201, 9832, 4392, 7472],
        'cust_age': [13, 21, 19, 21, 60],
        'cust_sale': [0, 0, 0.2, 0.15, 0.3],
        'cust_year_birth': [2008, 2000, 2002, 2000, 1961],
        'cust_order': [1400, 14142, 900, 1240, 8430]
    })

In [ ]:
# Задание 15.3
import pandas as pd

def delete_columns(df, columns=[]):
    """
    Напишите функцию delete_columns(df, col=[]), которая удаляет столбцы из DataFrame и возвращает новую таблицу. 
    Если одно из указанных столбцов в таблице не существует, то функция должна возвращать None.
    """
    try:
        df = df.drop(columns, axis=1)
    except ValueError:
        df = None
    return df

if __name__ == '__main__':
    customer_df = pd.DataFrame({
        'number': [0, 1, 2, 3, 4],
        'cust_id': [128, 1201, 9832, 4392, 7472],
        'cust_age': [13, 21, 19, 21, 60],
        'cust_sale': [0, 0, 0.2, 0.15, 0.3],
        'cust_year_birth': [2008, 2000, 2002, 2000, 1961],
        'cust_order': [1400, 14142, 900, 1240, 8430]
    })
    columns_for_delete= ['number', 'cust_age'] #выбранные вами столбцы
    new_df = delete_columns(customer_df, columns_for_delete)
    print(new_df)

   cust_id  cust_sale  cust_year_birth  cust_order
0      128       0.00             2008        1400
1     1201       0.00             2000       14142
2     9832       0.20             2002         900
3     4392       0.15             2000        1240
4     7472       0.30             1961        8430

In [ ]:
countries_df = pd.DataFrame({
    'country': ['Англия', 'Канада', 'США', 'Россия', 'Украина', 'Беларусь', 'Казахстан'],
    'population': [56.29, 38.05, 322.28, 146.24, 45.5, 9.5, 17.04],
    'square': [133396, 9984670, 9826630, 17125191, 603628, 207600, 2724902]
})

# Рассчитайте среднюю плотность населения всех представленных стран 
# (количество человек на квадратный километр). Ответ округлите до сотых.

# Плотность населения рассчитывается как общее количество человек, отнесённое к общей площади. 
# Обратите внимание, что население в таблице представлено в миллионах.

((countries_df['population'] * 1000000) / countries_df['square']).mean()

84.93080566562001

In [ ]:
display(melb_df['Date'])

0         3/12/2016
1         4/02/2016
2         4/03/2017
3         4/03/2017
4         4/06/2016
            ...
13575    26/08/2017
13576    26/08/2017
13577    26/08/2017
13578    26/08/2017
13579    26/08/2017
Name: Date, Length: 13580, dtype: object

In [ ]:
melb_df['Date'] = pd.to_datetime(melb_df['Date'])
display(melb_df['Date'])

0       2016-03-12
1       2016-04-02
2       2017-04-03
3       2017-04-03
4       2016-04-06
           ...
13575   2017-08-26
13576   2017-08-26
13577   2017-08-26
13578   2017-08-26
13579   2017-08-26
Name: Date, Length: 13580, dtype: datetime64[ns]

In [ ]:
years_sold = melb_df['Date'].dt.year
print(years_sold)
print('Min year sold:', years_sold.min())
print('Max year sold:', years_sold.max())
print('Mode year sold:', years_sold.mode()[0])

0        2016
1        2016
2        2017
3        2017
4        2016
         ...
13575    2017
13576    2017
13577    2017
13578    2017
13579    2017
Name: Date, Length: 13580, dtype: int64
Min year sold: 2016
Max year sold: 2017
Mode year sold: 2017

In [ ]:
melb_df['MonthSale'] = melb_df['Date'].dt.month
melb_df['MonthSale'].value_counts(normalize=True)

8     0.136230
7     0.135125
5     0.121060
6     0.108174
3     0.103682
4     0.091753
9     0.087482
10    0.062887
11    0.055228
12    0.053387
2     0.024521
1     0.020471
Name: MonthSale, dtype: float64

In [ ]:
delta_days = melb_df['Date'] - pd.to_datetime('2016-01-01') 
display(delta_days)

0        71 days
1        92 days
2       458 days
3       458 days
4        96 days
          ...
13575   603 days
13576   603 days
13577   603 days
13578   603 days
13579   603 days
Name: Date, Length: 13580, dtype: timedelta64[ns]

In [ ]:
display(delta_days.dt.days)

0         71
1         92
2        458
3        458
4         96
        ...
13575    603
13576    603
13577    603
13578    603
13579    603
Name: Date, Length: 13580, dtype: int64

In [ ]:
melb_df['AgeBuilding'] = melb_df['Date'].dt.year - melb_df['YearBuilt']
display(melb_df['AgeBuilding'])

0         46
1        116
2        117
3         47
4          2
        ...
13575     36
13576     22
13577     20
13578     97
13579     97
Name: AgeBuilding, Length: 13580, dtype: int64

In [ ]:
melb_df = melb_df.drop('YearBuilt', axis=1)

In [ ]:
# 16.3

# Создайте в таблице melb_df признак WeekdaySale (день недели). 
# Найдите, сколько объектов недвижимости было продано в выходные (суббота и воскресенье), 
# результат занесите в переменную weekend_count. 
# В качестве ответа введите результат вывода переменной weekend_count.

melb_df['WeekdaySale'] = melb_df['Date'].dt.dayofweek

In [ ]:
melb_df.columns

Index(['Suburb', 'Address', 'Rooms', 'Type', 'Price', 'Method', 'SellerG',
       'Date', 'Distance', 'Postcode', 'Bedroom', 'Bathroom', 'Car',
       'Landsize', 'BuildingArea', 'CouncilArea', 'Lattitude', 'Longtitude',
       'Regionname', 'Propertycount', 'MeanRoomsSquare', 'AreaRatio',
       'MonthSale', 'AgeBuilding', 'WeekdaySale'],
      dtype='object')

In [ ]:
melb_df.head(2)

       Suburb          Address  Rooms  ... MonthSale  AgeBuilding WeekdaySale
0  Abbotsford     85 Turner St      2  ...         3           46           5
1  Abbotsford  25 Bloomburg St      2  ...         4          116           5

[2 rows x 25 columns]

In [ ]:
melb_df['WeekdaySale'].unique()

array([5, 0, 2, 1, 6, 3, 4])

In [ ]:
mask = (melb_df['WeekdaySale'] == 5) | (melb_df['WeekdaySale'] == 6)
weekend_count = melb_df[mask].shape[0]
print(weekend_count)

9226

In [ ]:
ufo = pd.read_csv('ufo.csv', sep=',')

ufo.head(3)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [ ]:
ufo.describe(include=['object'])

           City Colors Reported Shape Reported  State              Time
count     18216            2882          15597  18241             18241
unique     6476              27             27     52             16145
top     Seattle             RED          LIGHT     CA  11/16/1999 19:00
freq        187             780           2803   2529                27

In [ ]:
# Задание 16.4

# В каком году отмечается наибольшее количество случаев наблюдения НЛО в США?

ufo['datetime'] = pd.to_datetime(ufo['Time'])
ufo = ufo.drop('Time', axis=1)
ufo.head(4)

          City Colors Reported Shape Reported State            datetime
0       Ithaca             NaN       TRIANGLE    NY 1930-06-01 22:00:00
1  Willingboro             NaN          OTHER    NJ 1930-06-30 20:00:00
2      Holyoke             NaN           OVAL    CO 1931-02-15 14:00:00
3      Abilene             NaN           DISK    KS 1931-06-01 13:00:00

In [ ]:
ufo['datetime'].dt.year.mode()

0    1999
dtype: int64

In [ ]:
# Задание 16.5

# Найдите средний интервал времени (в днях) между двумя последовательными случаями наблюдения НЛО 
# в штате Невада (NV).
# Чтобы выделить дату из столбца Time, можно воспользоваться атрибутом datetime date.

# Чтобы вычислить разницу между двумя соседними датами в столбце, примените к нему метод diff().

# Чтобы перевести интервал времени в дни, воспользуйтесь атрибутом timedelta days.

res = (ufo[ufo['State'] == 'NV']['datetime'].dt.date).diff()
res

76            NaT
172     1678 days
565     2767 days
566        0 days
613      290 days
           ...
17447     22 days
17567     14 days
17617      6 days
17890     32 days
18104     33 days
Name: datetime, Length: 284, dtype: timedelta64[ns]

In [ ]:
res.dt.days.mean()

68.92932862190813

In [ ]:
print(melb_df['Address'].nunique())
# 13371

13378

In [ ]:
print(melb_df['Address'].loc[177])
print(melb_df['Address'].loc[1812])
print(melb_df['Address'].loc[9001])
# 2/119 Railway St N
# 9/400 Dandenong Rd
# 172 Danks St

2/119 Railway St N
9/400 Dandenong Rd
172 Danks St

In [ ]:
def get_street_type(address):
# Создаём список географических пометок exclude_list.
    exclude_list = ['N', 'S', 'W', 'E']
# Метод split() разбивает строку на слова по пробелу.
# В результате получаем список слов в строке и заносим его в переменную address_list.
    address_list = address.split(' ')
# Обрезаем список, оставляя в нём только последний элемент,
# потенциальный подтип улицы, и заносим в переменную street_type.
    street_type = address_list[-1]
# Делаем проверку на то, что полученный подтип является географической пометкой.
# Для этого проверяем его на наличие в списке exclude_list.
    if street_type in exclude_list:
# Если переменная street_type является географической пометкой,
# переопределяем её на второй элемент с конца списка address_list.
        street_type = address_list[-2]
# Возвращаем переменную street_type, в которой хранится подтип улицы.
    return street_type

In [ ]:
street_types = melb_df['Address'].apply(get_street_type)
display(street_types)

0        St
1        St
2        St
3        La
4        St
         ..
13575    Cr
13576    Dr
13577    St
13578    St
13579    St
Name: Address, Length: 13580, dtype: object

In [ ]:
print(street_types.nunique())
# 56

56

In [ ]:
display(street_types.value_counts())

St           8012
Rd           2825
Ct            612
Dr            447
Av            321
Gr            311
Pde           211
Pl            169
Cr            152
Cl            100
La             67
Bvd            53
Tce            47
Avenue         40
Wy             40
Cct            25
Hwy            24
Parade         15
Boulevard      13
Sq             11
Crescent        9
Cir             7
Strand          7
Esplanade       6
Grove           5
Fairway         4
Mews            4
Grn             4
Gdns            4
Righi           3
Crossway        3
Victoria        2
Ridge           2
Esp             2
Crofts          2
Ave             1
Dell            1
Glade           1
Grange          1
Nook            1
Corso           1
Grand           1
Eyrie           1
Hts             1
Loop            1
Cove            1
Terrace         1
Gra             1
Qy              1
Woodland        1
East            1
Outlook         1
Summit          1
Athol           1
Res             1
Highway         1
Name: Address, dtype: int64

In [ ]:
popular_stypes =street_types.value_counts().nlargest(10).index
print(popular_stypes)
# Index(['St', 'Rd', 'Ct', 'Dr', 'Av', 'Gr', 'Pde', 'Pl', 'Cr', 'Cl'], dtype='object')

Index(['St', 'Rd', 'Ct', 'Dr', 'Av', 'Gr', 'Pde', 'Pl', 'Cr', 'Cl'], dtype='object')

In [ ]:
melb_df['StreetType'] = street_types.apply(lambda x: x if x in popular_stypes else 'other')
display(melb_df['StreetType'])

0           St
1           St
2           St
3        other
4           St
         ...
13575       Cr
13576       Dr
13577       St
13578       St
13579       St
Name: StreetType, Length: 13580, dtype: object

In [ ]:
print(melb_df['StreetType'].nunique())
# 11

11

In [ ]:
melb_df = melb_df.drop('Address', axis=1)

In [ ]:
#  17.2

# Ранее, в задании 16.3, мы создали признак WeekdaySale в таблице melb_df — день недели продажи. 
# Из полученных в задании результатов можно сделать вывод, что объекты недвижимости в Мельбурне 
# продаются преимущественно по выходным (суббота и воскресенье).
# Напишите функцию get_weekend(weekday), которая принимает на вход элемент столбца WeekdaySale 
# и возвращает 1, если день является выходным, и 0 — в противном случае, и создайте столбец Weekend 
# в таблице melb_df с помощью неё.

# Примените эту функцию к столбцу и вычислите среднюю цену объекта недвижимости, проданного 
# в выходные дни. Результат округлите до сотых.
def get_weekend(weekday: int) -> int:
    if weekday in [5, 6]:
        return 1
    return 0

melb_df['Weekend'] = melb_df['WeekdaySale'].apply(get_weekend)
melb_df.head(4)

       Suburb  Rooms Type  ...  WeekdaySale StreetType Weekend
0  Abbotsford      2    h  ...            5         St       1
1  Abbotsford      2    h  ...            5         St       1
2  Abbotsford      3    h  ...            0         St       0
3  Abbotsford      3    h  ...            0      other       0

[4 rows x 26 columns]

In [ ]:
melb_df[melb_df['Weekend'] == 1]['Price'].mean()

1083291.6953175808

In [ ]:
# Задание 17.3

# Преобразуйте столбец SellerG с наименованиями риелторских компаний в таблице melb_df 
# следующим образом: оставьте в столбце только 49 самых популярных компаний, а остальные обозначьте 
# как 'other'.
# Найдите, во сколько раз минимальная цена объектов недвижимости, проданных компанией 'Nelson', 
# больше минимальной цены объектов, проданных компаниями, обозначенными как 'other'. 
# Ответ округлите до десятых.

most_pop_firms = melb_df['SellerG'].value_counts().nlargest(49).index
most_pop_firms

Index(['Nelson', 'Jellis', 'hockingstuart', 'Barry', 'Ray', 'Marshall',
       'Buxton', 'Biggin', 'Brad', 'Woodards', 'Fletchers', 'Jas', 'Greg',
       'McGrath', 'Sweeney', 'Noel', 'Miles', 'RT', 'Gary', 'Harcourts',
       'Hodges', 'YPA', 'Stockdale', 'Village', 'Kay', 'Raine', 'Williams',
       'Love', 'Douglas', 'Chisholm', 'RW', 'Rendina', 'HAR', 'O'Brien', 'C21',
       'Collins', 'Cayzer', 'Purplebricks', 'Eview', 'Philip', 'Buckingham',
       'Bells', 'Thomson', 'Alexkarbon', 'Nick', 'McDonald', 'Burnham',
       'Moonee', 'LITTLE'],
      dtype='object')

In [ ]:
melb_df['SellerG'] = melb_df['SellerG'].apply(lambda x: x if x in most_pop_firms else 'other')

In [ ]:
nelson_sum = melb_df[melb_df['SellerG'] == 'Nelson']['Price'].min()
other_sum = melb_df[melb_df['SellerG'] == 'other']['Price'].min()
nelson_sum/other_sum

1.297709923664122

In [ ]:
# 17.4
import pandas as pd

def get_experience(arg):
    """
    Напишите функцию get_experience(arg), аргументом которой является строка столбца с опытом работы. 
    Функция должна возвращать опыт работы в месяцах. Не забудьте привести результат к целому числу.
    """
    arg = arg.split()
    if len(arg) == 6:
        return int(arg[-4]) * 12 + int(arg[-2])
    elif arg[-1].startswith('м'):
        res = int(arg[-2])
    elif arg[-1].startswith('л') or arg[-1].startswith('г'):
        res = int(arg[-2]) * 12
    return res
        

if __name__ == '__main__':
    experience_col = pd.Series([
        'Опыт работы 8 лет 3 месяца',
        'Опыт работы 3 года 5 месяцев',
        'Опыт работы 1 год 9 месяцев',
        'Опыт работы 3 месяца',
        'Опыт работы 6 лет'
        ])
    experience_month = experience_col.apply(get_experience)
    print(experience_month)

0    99
1    41
2    21
3     3
4    72
dtype: int64

In [ ]:
# Категориальные данные

# создаём пустой список
unique_list = []
# пробегаемся по именам столбцов в таблице
for col in melb_df.columns:
    # создаём кортеж (имя столбца, число уникальных значений)
    item = (col, melb_df[col].nunique(),melb_df[col].dtype) 
    # добавляем кортеж в список
    unique_list.append(item) 
# создаём вспомогательную таблицу и сортируем её
unique_counts = pd.DataFrame(
    unique_list,
    columns=['Column_Name', 'Num_Unique', 'Type']
).sort_values(by='Num_Unique',  ignore_index=True)
# выводим её на экран
display(unique_counts)

        Column_Name  Num_Unique            Type
0           Weekend           2           int64
1              Type           3          object
2            Method           5          object
3       WeekdaySale           7           int64
4        Regionname           8          object
5          Bathroom           9           int64
6             Rooms           9           int64
7               Car          11           int64
8        StreetType          11          object
9           Bedroom          12           int64
10        MonthSale          12           int64
11      CouncilArea          33          object
12          SellerG          50          object
13             Date          58  datetime64[ns]
14      AgeBuilding         152           int64
15         Postcode         198           int64
16         Distance         202         float64
17    Propertycount         311           int64
18           Suburb         314          object
19     BuildingArea         602         float64
20  MeanRoomsSquare        1277         float64
21         Landsize        1448         float64
22            Price        2204         float64
23        Lattitude        6503         float64
24        AreaRatio        6521         float64
25       Longtitude        7063         float64

In [ ]:
display(melb_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 26 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Suburb           13580 non-null  object
 1   Rooms            13580 non-null  int64
 2   Type             13580 non-null  object
 3   Price            13580 non-null  float64
 4   Method           13580 non-null  object
 5   SellerG          13580 non-null  object
 6   Date             13580 non-null  datetime64[ns]
 7   Distance         13580 non-null  float64
 8   Postcode         13580 non-null  int64
 9   Bedroom          13580 non-null  int64
 10  Bathroom         13580 non-null  int64
 11  Car              13580 non-null  int64
 12  Landsize         13580 non-null  float64
 13  BuildingArea     13580 non-null  float64
 14  CouncilArea      12211 non-null  object
 15  Lattitude        13580 non-null  float64
 16  Longtitude       13580 non-null  float64
 17  Regionname       13580 non-null  object
 18  Propertycount    13580 non-null  int64
 19  MeanRoomsSquare  13580 non-null  float64
 20  AreaRatio        13580 non-null  float64
 21  MonthSale        13580 non-null  int64
 22  AgeBuilding      13580 non-null  int64
 23  WeekdaySale      13580 non-null  int64
 24  StreetType       13580 non-null  object
 25  Weekend          13580 non-null  int64
dtypes: datetime64[ns](1), float64(8), int64(10), object(7)
memory usage: 2.7+ MB

None

In [ ]:
cols_to_exclude = ['Date', 'Rooms', 'Bedroom', 'Bathroom', 'Car'] # список столбцов, которые мы не берём во внимание
max_unique_count = 150 # задаём максимальное число уникальных категорий
for col in melb_df.columns: # цикл по именам столбцов
    if melb_df[col].nunique() < max_unique_count and col not in cols_to_exclude: # проверяем условие
        melb_df[col] = melb_df[col].astype('category') # преобразуем тип столбца
display(melb_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 26 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Suburb           13580 non-null  object
 1   Rooms            13580 non-null  int64
 2   Type             13580 non-null  category
 3   Price            13580 non-null  float64
 4   Method           13580 non-null  category
 5   SellerG          13580 non-null  category
 6   Date             13580 non-null  datetime64[ns]
 7   Distance         13580 non-null  float64
 8   Postcode         13580 non-null  int64
 9   Bedroom          13580 non-null  int64
 10  Bathroom         13580 non-null  int64
 11  Car              13580 non-null  int64
 12  Landsize         13580 non-null  float64
 13  BuildingArea     13580 non-null  float64
 14  CouncilArea      12211 non-null  category
 15  Lattitude        13580 non-null  float64
 16  Longtitude       13580 non-null  float64
 17  Regionname       13580 non-null  category
 18  Propertycount    13580 non-null  int64
 19  MeanRoomsSquare  13580 non-null  float64
 20  AreaRatio        13580 non-null  float64
 21  MonthSale        13580 non-null  category
 22  AgeBuilding      13580 non-null  int64
 23  WeekdaySale      13580 non-null  category
 24  StreetType       13580 non-null  category
 25  Weekend          13580 non-null  category
dtypes: category(9), datetime64[ns](1), float64(8), int64(7), object(1)
memory usage: 1.9+ MB

None

In [ ]:
print(melb_df['Regionname'].cat.categories)
print(melb_df['Regionname'].cat.codes.unique())

Index(['Eastern Metropolitan', 'Eastern Victoria', 'Northern Metropolitan',
       'Northern Victoria', 'South-Eastern Metropolitan',
       'Southern Metropolitan', 'Western Metropolitan', 'Western Victoria'],
      dtype='object')
[2 6 5 0 4 1 3 7]

In [ ]:
print(melb_df['Type'].cat.categories)

Index(['h', 't', 'u'], dtype='object')

In [ ]:
melb_df['Type'] = melb_df['Type'].cat.rename_categories({
    'u': 'unit',
    't': 'townhouse',
    'h': 'house'
})
display(melb_df['Type'])

0        house
1        house
2        house
3        house
4        house
         ...
13575    house
13576    house
13577    house
13578    house
13579    house
Name: Type, Length: 13580, dtype: category
Categories (3, object): ['house', 'townhouse', 'unit']

In [ ]:
melb_df['Type'] = melb_df['Type'].cat.add_categories('flat')
new_houses_types = pd.Series(['unit', 'house', 'flat', 'flat', 'house'])
new_houses_types = new_houses_types.astype(melb_df['Type'].dtype)
display(new_houses_types)

0     unit
1    house
2     flat
3     flat
4    house
dtype: category
Categories (4, object): ['house', 'townhouse', 'unit', 'flat']

In [ ]:
melb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 26 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Suburb           13580 non-null  object
 1   Rooms            13580 non-null  int64
 2   Type             13580 non-null  category
 3   Price            13580 non-null  float64
 4   Method           13580 non-null  category
 5   SellerG          13580 non-null  category
 6   Date             13580 non-null  datetime64[ns]
 7   Distance         13580 non-null  float64
 8   Postcode         13580 non-null  int64
 9   Bedroom          13580 non-null  int64
 10  Bathroom         13580 non-null  int64
 11  Car              13580 non-null  int64
 12  Landsize         13580 non-null  float64
 13  BuildingArea     13580 non-null  float64
 14  CouncilArea      12211 non-null  category
 15  Lattitude        13580 non-null  float64
 16  Longtitude       13580 non-null  float64
 17  Regionname       13580 non-null  category
 18  Propertycount    13580 non-null  int64
 19  MeanRoomsSquare  13580 non-null  float64
 20  AreaRatio        13580 non-null  float64
 21  MonthSale        13580 non-null  category
 22  AgeBuilding      13580 non-null  int64
 23  WeekdaySale      13580 non-null  category
 24  StreetType       13580 non-null  category
 25  Weekend          13580 non-null  category
dtypes: category(9), datetime64[ns](1), float64(8), int64(7), object(1)
memory usage: 1.9+ MB

In [ ]:
popular_suburbs = melb_df['Suburb'].value_counts().nlargest(119).index
melb_df['Suburb'] = melb_df['Suburb'].apply(lambda x: x if x in popular_suburbs else 'other')

In [ ]:
display(melb_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 26 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Suburb           13580 non-null  object
 1   Rooms            13580 non-null  int64
 2   Type             13580 non-null  category
 3   Price            13580 non-null  float64
 4   Method           13580 non-null  category
 5   SellerG          13580 non-null  category
 6   Date             13580 non-null  datetime64[ns]
 7   Distance         13580 non-null  float64
 8   Postcode         13580 non-null  int64
 9   Bedroom          13580 non-null  int64
 10  Bathroom         13580 non-null  int64
 11  Car              13580 non-null  int64
 12  Landsize         13580 non-null  float64
 13  BuildingArea     13580 non-null  float64
 14  CouncilArea      12211 non-null  category
 15  Lattitude        13580 non-null  float64
 16  Longtitude       13580 non-null  float64
 17  Regionname       13580 non-null  category
 18  Propertycount    13580 non-null  int64
 19  MeanRoomsSquare  13580 non-null  float64
 20  AreaRatio        13580 non-null  float64
 21  MonthSale        13580 non-null  category
 22  AgeBuilding      13580 non-null  int64
 23  WeekdaySale      13580 non-null  category
 24  StreetType       13580 non-null  category
 25  Weekend          13580 non-null  category
dtypes: category(9), datetime64[ns](1), float64(8), int64(7), object(1)
memory usage: 1.9+ MB

None

In [ ]:
melb_df.head(10)

       Suburb  Rooms   Type  ...  WeekdaySale StreetType Weekend
0  Abbotsford      2  house  ...            5         St       1
1  Abbotsford      2  house  ...            5         St       1
2  Abbotsford      3  house  ...            0         St       0
3  Abbotsford      3  house  ...            0      other       0
4  Abbotsford      4  house  ...            2         St       0
5  Abbotsford      2  house  ...            1         St       0
6  Abbotsford      3  house  ...            1         St       0
7  Abbotsford      2  house  ...            2         St       0
8  Abbotsford      1   unit  ...            2         St       0
9  Abbotsford      2  house  ...            2         St       0

[10 rows x 26 columns]

In [ ]:
'other' in melb_df['Suburb'].unique()

True

In [ ]:
melb_df['Suburb'] = melb_df['Suburb'].astype('category')
melb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 26 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Suburb           13580 non-null  category
 1   Rooms            13580 non-null  int64
 2   Type             13580 non-null  category
 3   Price            13580 non-null  float64
 4   Method           13580 non-null  category
 5   SellerG          13580 non-null  category
 6   Date             13580 non-null  datetime64[ns]
 7   Distance         13580 non-null  float64
 8   Postcode         13580 non-null  int64
 9   Bedroom          13580 non-null  int64
 10  Bathroom         13580 non-null  int64
 11  Car              13580 non-null  int64
 12  Landsize         13580 non-null  float64
 13  BuildingArea     13580 non-null  float64
 14  CouncilArea      12211 non-null  category
 15  Lattitude        13580 non-null  float64
 16  Longtitude       13580 non-null  float64
 17  Regionname       13580 non-null  category
 18  Propertycount    13580 non-null  int64
 19  MeanRoomsSquare  13580 non-null  float64
 20  AreaRatio        13580 non-null  float64
 21  MonthSale        13580 non-null  category
 22  AgeBuilding      13580 non-null  int64
 23  WeekdaySale      13580 non-null  category
 24  StreetType       13580 non-null  category
 25  Weekend          13580 non-null  category
dtypes: category(10), datetime64[ns](1), float64(8), int64(7)
memory usage: 1.8 MB

In [ ]:
mask1 = melb_df['AreaRatio'] < -0.8
mask2 = melb_df['Type'] == 'townhouse'
mask3 = melb_df['SellerG'] == 'McGrath'
melb_df[mask1 & mask2 & mask3].sort_values(
    by=['Date', 'AreaRatio'],
    ascending=[True, False],
    ignore_index=True
).loc[:, ['Date', 'AreaRatio']]

        Date  AreaRatio
0 2016-07-26  -0.974922
1 2016-09-24  -0.971831
2 2016-11-27  -0.953608
3 2016-12-11  -0.945946
4 2017-08-04  -0.947368
5 2017-08-04  -0.970874

In [ ]:
# Задание 19.2

# Произведите сортировку столбца AreaRatio по убыванию. При этом индексы полученной таблицы 
# замените на новые. Какое значение площади здания находится в строке 1558? 
# Ответ округлите до целого числа.
melb_df.sort_values(by=['AreaRatio'], ascending=False, ignore_index=True)['BuildingArea'].loc[1558]

126.0

In [ ]:
# Задание 19.3

# Найдите таунхаусы (Type) с количеством жилых комнат (Rooms) больше 2. 
# Отсортируйте полученную таблицу сначала по возрастанию числа комнат, 
# а затем по убыванию средней площади комнат (MeanRoomsSquare). 
# Индексы таблицы замените на новые. Какая цена будет у объекта в строке 18? 
# Ответ запишите в виде целого числа.

type_mask = melb_df['Type'] == 'townhouse'
rooms_mask = melb_df['Rooms'] > 2

melb_df[type_mask & rooms_mask].sort_values(by=['Rooms', 'MeanRoomsSquare'],
                                            ascending=[True, False],
                                            ignore_index=True
                                            )['Price'].loc[18]

1300000.0

In [ ]:
melb_df.groupby('MonthSale')['Price'].agg('describe')

            count          mean            std  ...        50%        75%        max
MonthSale                                       ...
1           278.0  9.397921e+05  577668.924214  ...   795000.0  1111250.0  5200000.0
2           333.0  1.169051e+06  671564.357417  ...  1020000.0  1478000.0  4735000.0
3          1408.0  1.146762e+06  709573.596867  ...   945000.0  1400000.0  5600000.0
4          1246.0  1.050479e+06  591892.902979  ...   905500.0  1298750.0  5500000.0
5          1644.0  1.097807e+06  668492.867996  ...   905000.0  1371250.0  8000000.0
6          1469.0  1.068981e+06  606010.069052  ...   900000.0  1325000.0  7650000.0
7          1835.0  9.314698e+05  537390.803161  ...   800000.0  1150000.0  9000000.0
8          1850.0  1.056371e+06  619617.476541  ...   892000.0  1310000.0  6500000.0
9          1188.0  1.126349e+06  608734.690742  ...   980000.0  1360000.0  6400000.0
10          854.0  1.135970e+06  692950.251627  ...   950000.0  1416500.0  6250000.0
11          750.0  1.142503e+06  703666.227892  ...   950000.0  1399125.0  5050000.0
12          725.0  1.144737e+06  706549.007161  ...   938000.0  1412000.0  5700000.0

[12 rows x 8 columns]

In [ ]:
melb_df.groupby('Regionname')['SellerG'].agg(
    		['nunique', set]
)

                            nunique                                                set
Regionname
Eastern Metropolitan             26  {Biggin, HAR, Woodards, Kay, Ray, Purplebricks...
Eastern Victoria                 11  {Barry, HAR, other, Fletchers, McGrath, Ray, H...
Northern Metropolitan            40  {Biggin, HAR, Woodards, YPA, Kay, Ray, Purpleb...
Northern Victoria                11  {Barry, LITTLE, other, HAR, YPA, McGrath, Ray,...
South-Eastern Metropolitan       25  {HAR, Biggin, Woodards, Ray, Purplebricks, Sto...
Southern Metropolitan            38  {Biggin, HAR, Woodards, Kay, Ray, Purplebricks...
Western Metropolitan             34  {Biggin, HAR, Woodards, YPA, Ray, Moonee, Purp...
Western Victoria                  6       {HAR, other, YPA, Ray, hockingstuart, Raine}

In [ ]:
# Задание 20.1

# Сгруппируйте данные по признаку количества комнат и найдите среднюю цену объектов недвижимости 
# в каждой группе. В качестве ответа запишите количество комнат, для которых средняя цена наибольшая.

melb_df.groupby(by='Rooms')['Price'].mean().sort_values(ascending=False)

Rooms
7     1.920700e+06
5     1.870260e+06
6     1.849366e+06
8     1.602750e+06
4     1.445282e+06
3     1.076081e+06
10    9.000000e+05
2     7.750812e+05
1     4.338245e+05
Name: Price, dtype: float64

In [ ]:
# Задание 20.2

# Какой регион имеет наименьшую протяжённость по географической широте (Lattitude)?
# Для ответа на этот вопрос рассчитайте стандартное отклонение широты для каждого региона.
# В качестве ответа запишите название этого региона.

melb_df.groupby(by='Regionname')['Lattitude'].std().sort_values()

Regionname
Western Victoria              0.011579
Southern Metropolitan         0.043080
Eastern Metropolitan          0.047890
Northern Metropolitan         0.049639
Western Metropolitan          0.051251
South-Eastern Metropolitan    0.073411
Northern Victoria             0.084455
Eastern Victoria              0.147067
Name: Lattitude, dtype: float64

In [ ]:
melb_df.columns

Index(['Suburb', 'Rooms', 'Type', 'Price', 'Method', 'SellerG', 'Date',
       'Distance', 'Postcode', 'Bedroom', 'Bathroom', 'Car', 'Landsize',
       'BuildingArea', 'CouncilArea', 'Lattitude', 'Longtitude', 'Regionname',
       'Propertycount', 'MeanRoomsSquare', 'AreaRatio', 'MonthSale',
       'AgeBuilding', 'WeekdaySale', 'StreetType', 'Weekend'],
      dtype='object')

In [ ]:
# Задание 20.3

# Какая риелторская компания (SellerG) имеет наименьшую общую прибыль за период 
# с 1 мая по 1 сентября (включительно) 2017 года?
# Для ответа на этот вопрос рассчитайте сумму продаж (Price) каждой компании в заданный период.
# Не забудьте перевести даты в формат datetime.

# Подсказка (1 из 3): Произведите фильтрацию по условию попадания данных о продажах в интервал указанных дат.
# Подсказка (2 из 3): Сгруппируйте данные по признаку SellerG и посчитайте сумму продаж для каждой компании.
# Подсказка (3 из 3): Отсортируйте данные по возрастанию.

from datetime import datetime


period_mask = (melb_df['Date'] >= datetime(year=2017, month=5, day=1)) \
& (melb_df['Date'] <= datetime(year=2017, month=9, day=1))

melb_df[period_mask].groupby(by='SellerG')['Price'].sum().sort_values(ascending=True)

SellerG
LITTLE             2742000.0
Cayzer             4439000.0
Burnham            4550500.0
Moonee             7328000.0
Thomson            8332000.0
Bells              8656000.0
Alexkarbon        10985000.0
McDonald          14637500.0
Rendina           15422276.0
Nick              16890000.0
Douglas           18341000.0
Buckingham        19033000.0
C21               19515000.0
Eview             19791500.0
Collins           20217000.0
Philip            22051800.0
Chisholm          23225000.0
Williams          23297000.0
Love              23365500.0
Purplebricks      23401000.0
O'Brien           23855508.0
HAR               25568000.0
Village           26473000.0
RW                29261000.0
Raine             30687700.0
Stockdale         35409800.0
Sweeney           36882750.0
Gary              39138400.0
Hodges            43231000.0
YPA               46354350.0
Miles             47582000.0
Kay               48569500.0
RT                50498000.0
Brad              55955000.0
Jas               59281600.0
Harcourts         68720250.0
McGrath           78386500.0
Greg              85621000.0
Woodards          85977500.0
Noel              88129800.0
Fletchers        108847700.0
Biggin           110429500.0
Buxton           219104000.0
Ray              249572986.0
Marshall         253957888.0
hockingstuart    282834310.0
Barry            296723050.0
other            365038432.0
Nelson           379767500.0
Jellis           414121833.0
Name: Price, dtype: float64

In [ ]:
melb_df.groupby(['Rooms', 'Type'])['Price'].mean().unstack()

Type          house     townhouse          unit  flat
Rooms
1      8.668655e+05  5.927045e+05  3.899289e+05   NaN
2      1.017238e+06  7.101585e+05  6.104905e+05   NaN
3      1.109233e+06  9.847087e+05  8.505963e+05   NaN
4      1.462283e+06  1.217092e+06  1.037476e+06   NaN
5      1.877327e+06  1.035000e+06           NaN   NaN
6      1.869508e+06           NaN  5.200000e+05   NaN
7      1.920700e+06           NaN           NaN   NaN
8      1.510286e+06           NaN  2.250000e+06   NaN
10     9.000000e+05           NaN           NaN   NaN

In [ ]:
melb_df.pivot_table(
    values='Price',
    index='Rooms',
    columns='Type'
).round(2)

Type        house   townhouse        unit
Rooms
1       866865.52   592704.55   389928.92
2      1017237.81   710158.46   610490.51
3      1109233.38   984708.66   850596.34
4      1462283.08  1217092.00  1037476.19
5      1877326.92  1035000.00         NaN
6      1869507.58         NaN   520000.00
7      1920700.00         NaN         NaN
8      1510285.71         NaN  2250000.00
10      900000.00         NaN         NaN

In [ ]:
melb_df.pivot_table(
    values='Price',
    index='Regionname',
    columns='Weekend',
    aggfunc='count',
)

Weekend                        0     1
Regionname
Eastern Metropolitan         447  1024
Eastern Victoria              13    40
Northern Metropolitan       1258  2632
Northern Victoria             11    30
South-Eastern Metropolitan   123   327
Southern Metropolitan       1534  3161
Western Metropolitan         960  1988
Western Victoria               8    24

In [ ]:
melb_df.pivot_table(
    values='Landsize',
    index='Regionname',
    columns='Type',
    aggfunc=['median', 'mean'],
    fill_value=0
)

                           median            ...        mean
Type                        house townhouse  ...   townhouse        unit
Regionname                                   ...
Eastern Metropolitan        674.0     233.5  ...  269.440678  330.444444
Eastern Victoria            843.0       0.0  ...    0.000000  295.333333
Northern Metropolitan       459.5     134.0  ...  317.325733  495.026538
Northern Victoria           724.0       0.0  ...    0.000000    0.000000
South-Eastern Metropolitan  630.5     240.0  ...  212.160000  357.864865
Southern Metropolitan       586.0     246.0  ...  278.858824  466.380245
Western Metropolitan        531.0     198.0  ...  244.560669  557.637232
Western Victoria            599.5       0.0  ...    0.000000    0.000000

[8 rows x 6 columns]

In [ ]:
melb_df.pivot_table(
    values='Price',
    index=['Method','Type'],
    columns='Regionname',
    aggfunc='median',
    fill_value=0
)

Regionname        Eastern Metropolitan  ...  Western Victoria
Method Type                             ...
PI     house                   1244000  ...            630000
       townhouse                760000  ...                 0
       unit                     650000  ...                 0
S      house                   1127000  ...            397500
       townhouse                828000  ...                 0
       unit                     645750  ...                 0
SA     house                    932500  ...                 0
       townhouse                807500  ...                 0
       unit                          0  ...                 0
SP     house                   1050000  ...            360000
       townhouse                910000  ...                 0
       unit                     515000  ...                 0
VB     house                   1100000  ...                 0
       townhouse                892500  ...                 0
       unit                     500000  ...                 0

[15 rows x 8 columns]

In [ ]:
pivot = melb_df.pivot_table(
    values='Landsize',
    index='Regionname',
    columns='Type',
    aggfunc=['median', 'mean'],
    fill_value=0
)

In [ ]:
pivot

                           median            ...        mean
Type                        house townhouse  ...   townhouse        unit
Regionname                                   ...
Eastern Metropolitan        674.0     233.5  ...  269.440678  330.444444
Eastern Victoria            843.0       0.0  ...    0.000000  295.333333
Northern Metropolitan       459.5     134.0  ...  317.325733  495.026538
Northern Victoria           724.0       0.0  ...    0.000000    0.000000
South-Eastern Metropolitan  630.5     240.0  ...  212.160000  357.864865
Southern Metropolitan       586.0     246.0  ...  278.858824  466.380245
Western Metropolitan        531.0     198.0  ...  244.560669  557.637232
Western Victoria            599.5       0.0  ...    0.000000    0.000000

[8 rows x 6 columns]

In [ ]:
pivot.columns

MultiIndex([('median',     'house'),
            ('median', 'townhouse'),
            ('median',      'unit'),
            (  'mean',     'house'),
            (  'mean', 'townhouse'),
            (  'mean',      'unit')],
           names=[None, 'Type'])

In [ ]:
pivot['mean']['unit']

Regionname
Eastern Metropolitan          330.444444
Eastern Victoria              295.333333
Northern Metropolitan         495.026538
Northern Victoria               0.000000
South-Eastern Metropolitan    357.864865
Southern Metropolitan         466.380245
Western Metropolitan          557.637232
Western Victoria                0.000000
Name: unit, dtype: float64

In [ ]:
mask = pivot['mean']['house'] < pivot['median']['house']
filtered_pivot = pivot[mask]
display(filtered_pivot)

                      median                       mean
Type                   house townhouse unit       house   townhouse        unit
Regionname
Southern Metropolitan  586.0     246.0    0  569.643881  278.858824  466.380245
Western Metropolitan   531.0     198.0   62  507.883406  244.560669  557.637232

In [ ]:
print(list(filtered_pivot.index))

['Southern Metropolitan', 'Western Metropolitan']

In [ ]:
filtered_pivot.loc['Southern Metropolitan']

        Type
median  house        586.000000
        townhouse    246.000000
        unit           0.000000
mean    house        569.643881
        townhouse    278.858824
        unit         466.380245
Name: Southern Metropolitan, dtype: float64

In [ ]:
# Задание 21.2

# Составьте сводную таблицу, которая показывает зависимость медианной площади (BuildingArea) 
# здания от типа объекта недвижимости (Type) и количества жилых комнат в доме (Rooms). 
# Для какой комбинации признаков площадь здания наибольшая?
# В качестве ответа запишите эту комбинацию (тип здания, число комнат) через запятую, без пробелов.

melb_df.pivot_table(
    values='BuildingArea',
    index='Rooms',
    columns='Type',
    aggfunc=['median'],
    fill_value=0
)

      median
Type   house townhouse   unit
Rooms
1      126.0      88.0   69.5
2      126.0     114.0  110.0
3      126.0     126.0  126.0
4      141.0     159.5  126.0
5      177.0     152.0    0.0
6      126.0       0.0  171.0
7      216.5       0.0    0.0
8      126.0       0.0  126.0
10     126.0       0.0    0.0

In [ ]:
# Задание 21.3

# Составьте сводную таблицу, которая показывает зависимость медианной цены объекта недвижимости 
# (Price) от риелторского агентства (SellerG) и типа здания (Type).
# Во вновь созданной таблице найдите агентство, у которого медианная цена для зданий типа 
# unit максимальна. В качестве ответа запишите название этого агентства.

seller_pivot = melb_df.pivot_table(
    values='Price',
    index='SellerG',
    columns='Type',
    aggfunc=['median'],
    fill_value=0
)

seller_pivot['median']['unit'].sort_values(ascending=False)

SellerG
Nick             900000
Marshall         715000
Cayzer           707500
Kay              695000
Noel             693250
Buxton           670000
Fletchers        653000
Chisholm         640000
Philip           636000
RT               630000
C21              625500
RW               625500
Moonee           622000
O'Brien          618500
Hodges           605500
Eview            602000
Woodards         600000
Collins          592000
Jellis           591750
Purplebricks     582500
Williams         577000
hockingstuart    566000
Alexkarbon       560000
Miles            555000
Buckingham       553000
Gary             550000
Biggin           548000
Greg             547500
McGrath          542500
other            535000
Nelson           530000
HAR              518000
McDonald         502500
Barry            502000
Harcourts        500000
Ray              497500
Thomson          495000
Douglas          494500
Brad             465000
Rendina          459000
Bells            457500
Jas              455000
Raine            447500
LITTLE           447000
YPA              443500
Love             440000
Village          420000
Stockdale        410000
Sweeney          381000
Burnham          305000
Name: unit, dtype: int64